app/controllers/tiles_controller.rb

SELECT * FROM `tiles` ORDER BY lat DESC, lon ASC
---
  def index
    conditions = {}
    conditions.merge!({:woeid => params[:woeid]}) if params[:woeid]
    @tiles = Tile.all(:conditions => conditions, :order => 'lat DESC, lon ASC')

SELECT * FROM `tiles` WHERE (lat < 40.3 AND lon < -3.61) ORDER BY lat DESC, lon DESC LIMIT 1
---
  def show
    @tile = Tile.find(params[:id])